In [1]:
import pandas as pd

In [ ]:
animals = {
    'n1' : 'Tiger',
    'n2' : 'Bear' ,
    'n3' : 'Moose'
}
p_animals = pd.Series(animals)
animals = {
    'n1' : 'Tiger2',
    'n2' : 'Bear2' ,
    'n3' : 'moose2'
}
p_animals2 = pd.Series(animals)
animals = {
    'n1' : 'Tiger3',
    'n2' : 'Bear3' ,
    'n3' : 'moose3'
}
p_animals3 = pd.Series(animals)
df = pd.DataFrame([p_animals, p_animals2, p_animals3])
df

       n1     n2      n3
0   Tiger   Bear   Moose
1  Tiger2  Bear2  moose2
2  Tiger3  Bear3  moose3

In [5]:
df.loc[1]

n1    Tiger2
n2     Bear2
n3    moose2
Name: 1, dtype: object

In [7]:
df.loc[[0,2]]

       n1     n2      n3
0   Tiger   Bear   Moose
2  Tiger3  Bear3  moose3